Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes
The SurfacingMarkPropertyElementTypes class represents the available property element types for surfacing marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes.Name
Returns the name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes.Material
Returns the material property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes.Class
Returns the class property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes.Code
Returns the code property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes.SurfaceTreatmentName
Returns the surface treatment name property element type.
Returns: The requested property element type.